"""+ библиотека для парсинга. инфу брал с сайта https://pyneng.readthedocs.io/ru/latest/book/15_module_re/"""
import re

"""создаём "маску" для парсинга каждой строки"""
mask = r'\d{4}\-\d{2}\-\d{2} \d{2}:\d{2}:\d{2},\d{3} \- (\w*\.\w*) \[(\w*) *\]'

"""объявляем необходимые переменные"""
amount = 0
all_modes = []
diary = {}

"""почему-то у меня файл считывается только если прописать целиком путь"""
with open('C:/py/202-Advanced-Python-1/Basics/log.txt', 'r') as log:

    """рассматриваем отдельно каждую строку"""
    for i in log:

        """получаем строку, собержащую только необходимую информацию"""
        newline = re.findall(mask, i)

        if len(newline) != 0:
            """определяем модуль"""
            k1 = newline[0][0]
            """запоминаем тип сообщения"""
            k2 = newline[0][1]

            """заполняем словарь"""
            try:
                """регистрируем сообщение данного типа в данном модуле"""
                diary[k1][k2] += 1
            except:
                """в случае обнаружения нового модуля сразу регистрируем это сообщение"""
                diary[k1] = {'DEBUG': 0, 'INFO': 0, 'WARNING': 0, 'ERROR': 0}
                diary[k1][k2] += 1

        """чтобы проссуммировать все моды, сначала создадим список значений в каждой строке, а потом проссумируем их"""
        """считываем количество мод, которые были найдены в данной строке"""
        modes_in_line = re.findall(r'f|Found (\d+) modes', i)
        """создаём массив из значений"""
        if len(modes_in_line) != 0 and modes_in_line[0] != '':
            all_modes.append((int(modes_in_line[0])))

        """ищем количество "fun:" в тексте"""
        if re.match(r'.*fun:.*', i) != None:
            amount += 1


print("\n\nсловарь выглядит так:", diary, "\n\nколичество fun:",
      amount, '\n\nсумма всех мод в файле =', sum(all_modes))
